-- MySQL dump 10.13  Distrib 5.7.12, for Win64 (x86_64)
--
-- Host: localhost    Database: chatroom
-- ------------------------------------------------------
-- Server version	5.7.17-log

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `cr_avatars`
--

DROP TABLE IF EXISTS `cr_avatars`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `cr_avatars` (
  `uid` char(36) NOT NULL,
  `uavatar` blob,
  PRIMARY KEY (`uid`),
  CONSTRAINT `cr_avatars_ibfk_1` FOREIGN KEY (`uid`) REFERENCES `cr_users` (`uid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `cr_avatars`
--

LOCK TABLES `cr_avatars` WRITE;
/*!40000 ALTER TABLE `cr_avatars` DISABLE KEYS */;
/*!40000 ALTER TABLE `cr_avatars` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `cr_msgs`
--

DROP TABLE IF EXISTS `cr_msgs`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `cr_msgs` (
  `mid` int(11) NOT NULL AUTO_INCREMENT,
  `uid` char(36) NOT NULL,
  `mtime` timestamp(3) NOT NULL DEFAULT '0000-00-00 00:00:00.000',
  `mcontent` varchar(100) NOT NULL,
  `locked` tinyint(1) NOT NULL DEFAULT '0',
  `mhasprev` tinyint(1) NOT NULL DEFAULT '0',
  PRIMARY KEY (`mid`),
  KEY `uid` (`uid`),
  CONSTRAINT `cr_msgs_ibfk_1` FOREIGN KEY (`uid`) REFERENCES `cr_users` (`uid`)
) ENGINE=InnoDB AUTO_INCREMENT=299 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `cr_msgs`
--

LOCK TABLES `cr_msgs` WRITE;
/*!40000 ALTER TABLE `cr_msgs` DISABLE KEYS */;
INSERT INTO `cr_msgs` VALUES (1,'6937f16e-ef7f-42b4-a23f-b7e45966cb00','2017-07-21 09:15:57.000','Hello,&nbsp;world!',1,0),(7,'00000000-0000-0000-0000-000000000000','2017-07-21 12:30:53.000','嗨大家好，我是test用户，是本网站过去及将来唯一一个用户名只有4个字长的用户名。现在起，注册时的用户名必须至少要五个长度。',1,0),(8,'6937f16e-ef7f-42b4-a23f-b7e45966cb00','2017-07-22 08:49:31.000','这看起来是第三条，其实是第八条消息了。',0,0),(9,'6937f16e-ef7f-42b4-a23f-b7e45966cb00','2017-07-22 09:57:39.000','这是一条没有被锁定的消息',0,0),(10,'6937f16e-ef7f-42b4-a23f-b7e45966cb00','2017-07-22 09:57:54.000','这是一条被锁定的消息。',0,0),(11,'6937f16e-ef7f-42b4-a23f-b7e45966cb00','2017-07-22 10:00:12.000','这是一条真的被锁定的消息。',1,0),(12,'7fbe559d-a3a8-47e5-a4c9-13fe31f67acd','2017-07-22 10:41:57.000','这是一条VIP的消息。',0,0),(16,'6937f16e-ef7f-42b4-a23f-b7e45966cb00','2017-07-22 15:50:12.000','这是表情消息，其临时代码是#[s]&nbsp;(5)，去掉中间的空格。s是杀小兵的首字母。<br/><img src=\'img/em/s/5.gif\' alt=\'表情\' />',1,0),(20,'43eb65dc-7d12-4e46-9e3e-650d2d727283','2017-07-22 15:59:15.000','#[hl!]管理员关于表情消息的通知！<br/>现在起表情开放！临时格式#[字母](数字)。字母为g(郭嘉*20)，s(杀小兵*15)，b(甄姬*20)，后面的数字为序号。祝大家玩得开心！',1,0),(21,'6937f16e-ef7f-42b4-a23f-b7e45966cb00','2017-07-23 05:26:35.000','#[hl!]管理员的高亮特权测试！',1,0),(22,'6937f16e-ef7f-42b4-a23f-b7e45966cb00','2017-07-23 07:31:39.000','表情的大小<img src=\'img/em/s/5.gif\' alt=\'表情\' class=\'meme\'/>测试一下',1,0),(26,'43eb65dc-7d12-4e46-9e3e-650d2d727283','2017-07-23 08:08:07.000','#[hl!]通知：关于表情消息2<br/>已完成郭嘉及甄姬系列表情的添加，由于版权不清楚，切勿外流哦。<img src=\'img/em/b/2.gif\' alt=\'表情\' class=\'meme\'/>',1,0),(89,'6937f16e-ef7f-42b4-a23f-b7e45966cb00','2017-07-23 11:31:39.000','一二三四五六七八九十一二三四五六七八九十一二三四五六七八九十一二三四五六七八九十一二三四五六七八九十一二三四五六七八九十一二三四五六七八九十一二三四五六七八九十一二三四五六七八九十',0,0),(90,'6937f16e-ef7f-42b4-a23f-b7e45966cb00','2017-07-23 11:31:39.000','一二三四五六七八九十一二三四五六七八九十一二三四五六七八九十一二三四五六七八九十一二三四五六七八九十一二三四五六七八九十一二三四五六七八九十一二三四五六七八九十一二三四五六七八九十',0,1),(91,'6937f16e-ef7f-42b4-a23f-b7e45966cb00','2017-07-23 11:31:39.000','一二三四五六七八九十一二三四五六七八九十一二三四五六七八九十一二三四五六七八九十一二三四五六七八九十一二三四五六七八九十一二三四五六七八九十一二三四五六七八九十一二三四五六七八九十',0,1),(92,'6937f16e-ef7f-42b4-a23f-b7e45966cb00','2017-07-23 11:31:39.000','一二三四五六七八九十一二三四五六七八九十一二三四五六七八九十一二三四五六七八九十一二三四五六七八九十一二三四五六七八九十一二三四五六七八九十一二三四五六七八九十一二三四五六七八九十',0,1),(99,'ef6725f2-e5ae-4b86-abf3-dcd128258d9d','2017-07-23 12:03:01.000','大家好这里是本网站第一个正式非测试用户gsxab<img src=\'img/em/b/11.gif\' alt=\'表情\' class=\'meme\'/>。注册时间：2017-7-23&',1,0),(109,'43eb65dc-7d12-4e46-9e3e-650d2d727283','2017-07-23 13:39:56.000','#[hl!]本网站基本成型的通知<br/>一、即日起本网站可以开放注册，只要有你能连得上而且名字没有敏感字样<br/>有敏感字眼的话，管理员有权力对用户处以封禁或删除。<br/>二',1,0),(110,'43eb65dc-7d12-4e46-9e3e-650d2d727283','2017-07-23 13:39:56.000','、关于使用方式<br/>本网站输入框外的一切内容均需要鼠标停留才会显示。<br/>点击反白可以增加辨识度。<br/>三、关于管理员特权及会员特权<br/>目前除后台DBA外暂没有人',1,1),(111,'43eb65dc-7d12-4e46-9e3e-650d2d727283','2017-07-23 13:39:56.000','有删除消息封禁用户授予解除权限的能力。<br/>管理员的特权是管理员可以设置自己消息的高亮和锁定；会员和管理员还有一项没有卵用的特权是红名显示。<br/>四、赏罚条例<br/>暂时',1,1),(112,'43eb65dc-7d12-4e46-9e3e-650d2d727283','2017-07-23 13:39:56.000','没有，不过不允许用脚本刷注册或提交我这边数据库弄不好会挂。<br/>欢迎挑bug。<br/>黑暗系聊天室管理员&nbsp;2017-7-23&nbsp;20:12:30',1,1),(113,'43eb65dc-7d12-4e46-9e3e-650d2d727283','2017-07-23 14:40:59.000','#[hl!]通知：开放注册中文字符用户名<br/>之前虽然处理了转码的问题，但是官方忘记了开放，在此表示抱歉。',1,0),(114,'c1baaf63-4ce6-4adc-bf43-a6b2405ef8b0','2017-07-23 14:47:15.000','使用中文名称的用户前来报到！',1,0),(115,'43eb65dc-7d12-4e46-9e3e-650d2d727283','2017-07-23 14:54:08.000','通知：<br/>本<del>王</del>管理员决定对每个人第一个账户第一句话锁定留念。',1,0),(116,'9053d4a3-fc4e-4d6f-9669-066bcb03ef9c','2017-07-24 02:41:18.000','我是一个粉刷匠<img src=\'img/em/b/15.gif\' alt=\'表情\' class=\'meme\'/>',1,0),(117,'9053d4a3-fc4e-4d6f-9669-066bcb03ef9c','2017-07-24 02:42:06.000','粉刷本领强<img src=\'img/em/b/2.gif\' alt=\'表情\' class=\'meme\'/>',0,0),(118,'9053d4a3-fc4e-4d6f-9669-066bcb03ef9c','2017-07-24 02:44:03.000','Raineast&nbsp;赛高<img src=\'img/em/s/3.gif\' alt=\'表情\' class=\'meme\'/>',0,0),(119,'f4618c5c-2519-4824-9efe-e38b9bd5215e','2017-07-24 02:46:31.000','黑吗',1,0),(120,'9053d4a3-fc4e-4d6f-9669-066bcb03ef9c','2017-07-24 02:47:12.000','程序员专用&nbsp;&nbsp;黑<img src=\'img/em/s/5.gif\' alt=\'表情\' class=\'meme\'/>',0,0),(122,'f4618c5c-2519-4824-9efe-e38b9bd5215e','2017-07-24 02:47:30.000','我的发言在最底下',0,0),(124,'ef6725f2-e5ae-4b86-abf3-dcd128258d9d','2017-07-24 02:47:58.000','<img src=\'img/em/s/1.gif\' alt=\'表情\' class=\'meme\'/>我这边发送框加载错地方了……你们有毒',0,0),(125,'9053d4a3-fc4e-4d6f-9669-066bcb03ef9c','2017-07-24 02:48:22.000','大家&nbsp;水一水&nbsp;&nbsp;把服务器刷爆<img src=\'img/em/s/5.gif\' alt=\'表情\' class=\'meme\'/>',0,0),(127,'9053d4a3-fc4e-4d6f-9669-066bcb03ef9c','2017-07-24 02:49:04.000','zhaoyonghe&nbsp;傻b',0,0),(128,'9053d4a3-fc4e-4d6f-9669-066bcb03ef9c','2017-07-24 02:49:43.000','天王盖地虎&nbsp;&nbsp;永赫一米五',0,0),(129,'7a6418a6-24c5-4457-a1a0-e62d84e4fc26','2017-07-24 02:50:36.000','666',1,0),(130,'ee3fba46-ac20-46b2-bcbe-4632f48def6e','2017-07-24 02:50:38.000','<img src=\'img/em/g/12.gif\' alt=\'表情\' class=\'meme\'/>',1,0),(131,'7a6418a6-24c5-4457-a1a0-e62d84e4fc26','2017-07-24 02:51:39.000','<img src=\'img/em/s/8.gif\' alt=\'表情\' class=\'meme\'/>',0,0),(132,'7a6418a6-24c5-4457-a1a0-e62d84e4fc26','2017-07-24 02:51:56.000','<img src=\'img/em/g/5.gif\' alt=\'表情\' class=\'meme\'/>',0,0),(133,'f4618c5c-2519-4824-9efe-e38b9bd5215e','2017-07-24 02:51:57.000','注销',0,0),(135,'7a6418a6-24c5-4457-a1a0-e62d84e4fc26','2017-07-24 02:52:30.000','润东你要多喝奶茶',0,0),(137,'9053d4a3-fc4e-4d6f-9669-066bcb03ef9c','2017-07-24 02:52:39.000','把永赫账户注销了',0,0),(141,'9053d4a3-fc4e-4d6f-9669-066bcb03ef9c','2017-07-24 02:54:10.000','彼此彼此',0,0),(142,'7a6418a6-24c5-4457-a1a0-e62d84e4fc26','2017-07-24 02:54:24.000','b(￣▽￣)d',0,0),(144,'7a6418a6-24c5-4457-a1a0-e62d84e4fc26','2017-07-24 02:56:05.000','我觉得你们好像有毒',0,0),(145,'7a6418a6-24c5-4457-a1a0-e62d84e4fc26','2017-07-24 02:56:20.000','什么时候加上回车发送功能哇',0,0),(146,'7a6418a6-24c5-4457-a1a0-e62d84e4fc26','2017-07-24 02:57:02.000','总感觉自己要瞎了',0,0),(147,'7a6418a6-24c5-4457-a1a0-e62d84e4fc26','2017-07-24 02:57:19.000','盲人的世界原来是这样',0,0),(148,'9053d4a3-fc4e-4d6f-9669-066bcb03ef9c','2017-07-24 02:57:51.000','盲人没有发送键',0,0),(149,'43eb65dc-7d12-4e46-9e3e-650d2d727283','2017-07-24 02:58:12.000','#[hl!]……好水……可怕……',0,0),(151,'9053d4a3-fc4e-4d6f-9669-066bcb03ef9c','2017-07-24 02:58:52.000','凭什么管理员自带语句调色功能',0,0),(152,'9053d4a3-fc4e-4d6f-9669-066bcb03ef9c','2017-07-24 02:59:23.000','我要晋升vip',0,0),(153,'7cde4eb2-0219-4d74-b6b8-be55c17a3fd6','2017-07-24 02:59:24.000','花见花开借款和',1,0),(154,'43eb65dc-7d12-4e46-9e3e-650d2d727283','2017-07-24 02:59:29.000','#[hl!]管理员：<br/>我已经删除某人留言<br/>我已经删除某人留言<br/>我已经删除某人留言<br/>我已经删除某人留言<br/>我已经删除某人留言<br/>我已经删除',0,0),(155,'43eb65dc-7d12-4e46-9e3e-650d2d727283','2017-07-24 02:59:29.000','某人留言<br/>！！！！！！！！！',0,1),(156,'43eb65dc-7d12-4e46-9e3e-650d2d727283','2017-07-24 03:00:24.000','管理员可以没有调色功能<br/>比如这一句',0,0),(157,'7a6418a6-24c5-4457-a1a0-e62d84e4fc26','2017-07-24 03:00:26.000','我想要粉色的字体',0,0),(158,'9053d4a3-fc4e-4d6f-9669-066bcb03ef9c','2017-07-24 03:00:29.000','大帅说啥了',0,0),(159,'9053d4a3-fc4e-4d6f-9669-066bcb03ef9c','2017-07-24 03:00:47.000','首冲送字体',0,0),(160,'9053d4a3-fc4e-4d6f-9669-066bcb03ef9c','2017-07-24 03:03:52.000','怎么没人了',0,0),(161,'c1baaf63-4ce6-4adc-bf43-a6b2405ef8b0','2017-07-24 03:49:33.000','中文用户名修复，不知道什么时候多转了一次码。<img src=\'img/em/s/3.gif\' alt=\'表情\' class=\'meme\'/>',0,0),(162,'7a6418a6-24c5-4457-a1a0-e62d84e4fc26','2017-07-24 04:43:24.000','冲多少，怎么冲，来来来',0,0),(163,'6937f16e-ef7f-42b4-a23f-b7e45966cb00','2017-07-24 09:35:31.000','这条消息是使用了Session以后的测试',0,0),(164,'ef6725f2-e5ae-4b86-abf3-dcd128258d9d','2017-07-25 05:46:41.000','居然分配了和上次相同的ip我说为什么有人登进来了<img src=\'img/em/s/4.gif\' alt=\'表情\' class=\'meme\'/>',0,0),(165,'6937f16e-ef7f-42b4-a23f-b7e45966cb00','2017-07-25 06:00:07.000','send.jsp有时500正在调试',0,0),(166,'7a6418a6-24c5-4457-a1a0-e62d84e4fc26','2017-07-25 08:10:54.000','<img src=\'img/em/g/7.gif\' alt=\'表情\' class=\'meme\'/>',0,0),(167,'ef6725f2-e5ae-4b86-abf3-dcd128258d9d','2017-07-25 08:12:58.000','<img src=\'img/em/b/11.gif\' alt=\'表情\' class=\'meme\'/>喵？',0,0),(168,'7a6418a6-24c5-4457-a1a0-e62d84e4fc26','2017-07-26 00:55:03.000','biu!',0,0),(169,'6937f16e-ef7f-42b4-a23f-b7e45966cb00','2017-07-26 02:41:32.000','发送测试',0,0),(170,'6937f16e-ef7f-42b4-a23f-b7e45966cb00','2017-07-26 02:42:08.000','现在似乎已经实现对Ctrl+回车发送的支持',0,0),(171,'7a6418a6-24c5-4457-a1a0-e62d84e4fc26','2017-07-26 03:33:49.000','太大佬了',0,0),(172,'7a6418a6-24c5-4457-a1a0-e62d84e4fc26','2017-07-26 03:34:06.000','666',0,0),(173,'6937f16e-ef7f-42b4-a23f-b7e45966cb00','2017-07-26 03:50:01.000','其实没几行，查看user.jsp输出的HTML源码把ctrlenter的函数js扒下来就行',0,0),(174,'43eb65dc-7d12-4e46-9e3e-650d2d727283','2017-07-26 06:33:54.000','#[hl!]通知：头像系统已启用<br/>点击左边栏的巨型头像更换<br/>不允许使用不健康图片……',1,0),(175,'43eb65dc-7d12-4e46-9e3e-650d2d727283','2017-07-26 06:34:33.000','对了……善待服务器',0,0),(176,'6937f16e-ef7f-42b4-a23f-b7e45966cb00','2017-07-27 15:08:57.985','哈喽啊',0,0),(177,'6937f16e-ef7f-42b4-a23f-b7e45966cb00','2017-07-27 15:14:39.939','新的消息',0,0),(178,'6937f16e-ef7f-42b4-a23f-b7e45966cb00','2017-07-27 15:14:52.073','再一条',0,0),(179,'6937f16e-ef7f-42b4-a23f-b7e45966cb00','2017-07-27 15:20:17.970','好了吗',0,0),(180,'6937f16e-ef7f-42b4-a23f-b7e45966cb00','2017-07-28 00:47:46.563','再试一次',0,0),(181,'6937f16e-ef7f-42b4-a23f-b7e45966cb00','2017-07-28 00:52:15.370','再试第三次',0,0),(182,'6937f16e-ef7f-42b4-a23f-b7e45966cb00','2017-07-28 00:52:56.424','再试第三次',0,0),(183,'6937f16e-ef7f-42b4-a23f-b7e45966cb00','2017-07-28 00:55:19.736','再来',0,0),(184,'6937f16e-ef7f-42b4-a23f-b7e45966cb00','2017-07-28 00:59:34.665','第五次',0,0),(185,'6937f16e-ef7f-42b4-a23f-b7e45966cb00','2017-07-28 01:04:39.296','第六次',0,0),(186,'6937f16e-ef7f-42b4-a23f-b7e45966cb00','2017-07-28 01:05:49.503','第七次',0,0),(187,'6937f16e-ef7f-42b4-a23f-b7e45966cb00','2017-07-28 01:07:52.786','第八次',0,0),(188,'6937f16e-ef7f-42b4-a23f-b7e45966cb00','2017-07-28 01:09:31.920','第九次',0,0),(189,'6937f16e-ef7f-42b4-a23f-b7e45966cb00','2017-07-28 01:11:34.421','第十次',0,0),(190,'6937f16e-ef7f-42b4-a23f-b7e45966cb00','2017-07-28 01:13:30.611','dishiyici',0,0),(191,'6937f16e-ef7f-42b4-a23f-b7e45966cb00','2017-07-28 01:15:13.897','第十二次',0,0),(192,'6937f16e-ef7f-42b4-a23f-b7e45966cb00','2017-07-28 01:20:27.807','第十三次',0,0),(193,'6937f16e-ef7f-42b4-a23f-b7e45966cb00','2017-07-28 01:21:20.432','第十二次',0,0),(194,'6937f16e-ef7f-42b4-a23f-b7e45966cb00','2017-07-28 01:30:43.526','di13',0,0),(195,'6937f16e-ef7f-42b4-a23f-b7e45966cb00','2017-07-28 01:33:25.890','14',0,0),(196,'6937f16e-ef7f-42b4-a23f-b7e45966cb00','2017-07-28 01:37:49.452','15',0,0),(197,'6937f16e-ef7f-42b4-a23f-b7e45966cb00','2017-07-28 01:42:34.288','16',0,0),(198,'6937f16e-ef7f-42b4-a23f-b7e45966cb00','2017-07-28 01:44:20.700','17',0,0),(199,'6937f16e-ef7f-42b4-a23f-b7e45966cb00','2017-07-28 01:47:27.829','19<br/>',0,0),(200,'6937f16e-ef7f-42b4-a23f-b7e45966cb00','2017-07-28 01:48:23.053','现在右上的消息列表已经不需要刷新√',0,0),(201,'6937f16e-ef7f-42b4-a23f-b7e45966cb00','2017-07-28 01:51:49.899','再来一次',0,0),(202,'6937f16e-ef7f-42b4-a23f-b7e45966cb00','2017-07-28 01:57:13.107','hia<img src=\'img/em/s/5.gif\' alt=\'表情\' class=\'meme\'/>',0,0),(203,'6937f16e-ef7f-42b4-a23f-b7e45966cb00','2017-07-28 03:09:57.339','22222',0,0),(204,'6937f16e-ef7f-42b4-a23f-b7e45966cb00','2017-07-28 03:12:29.068','aaaaaa',0,0),(205,'6937f16e-ef7f-42b4-a23f-b7e45966cb00','2017-07-28 03:17:45.444','bbbb',0,0),(206,'00000000-0000-0000-0000-000000000000','2017-08-11 04:46:41.055','哈喽啊我是那个test用户',0,0),(207,'6937f16e-ef7f-42b4-a23f-b7e45966cb00','2017-08-11 05:01:46.911','test你好，我是test_user，本王是这个聊天室第一个账户！哈哈哈哈<img src=\'img/em/g/18.gif\' alt=\'表情\' class=\'meme\'/>',0,0),(208,'00000000-0000-0000-0000-000000000000','2017-08-11 05:02:43.932','哼，第一个账户算什么，你有本事也注册一个叫做test的用户名啊，看看能不能注册成功！<img src=\'img/em/b/4.gif\' alt=\'表情\' class=\'meme\'/>',0,0),(209,'6937f16e-ef7f-42b4-a23f-b7e45966cb00','2017-08-11 05:03:18.364','<img src=\'img/em/b/4.gif\' alt=\'表情\' class=\'meme\'/>那我就注册一个test空格好了！',0,0),(210,'00000000-0000-0000-0000-000000000000','2017-08-11 05:03:59.870','……你<img src=\'img/em/s/6.gif\' alt=\'表情\' class=\'meme\'/>',0,0),(211,'43eb65dc-7d12-4e46-9e3e-650d2d727283','2017-08-11 05:06:51.589','#[hl!]你们够了！管理员被你们炸出来了！',0,0),(212,'6937f16e-ef7f-42b4-a23f-b7e45966cb00','2017-08-11 05:09:58.035','鹳狸猿大人对不起（跪',0,0),(213,'9053d4a3-fc4e-4d6f-9669-066bcb03ef9c','2017-08-11 05:47:52.153','我是一个粉刷匠<img src=\'img/em/b/4.gif\' alt=\'表情\' class=\'meme\'/>',0,0),(297,'6937f16e-ef7f-42b4-a23f-b7e45966cb00','2017-08-11 07:34:48.247','刷了屋顶又刷墙刷子飞舞忙',0,0),(298,'6937f16e-ef7f-42b4-a23f-b7e45966cb00','2017-08-11 07:36:51.622','哎呀我的小鼻子变呀变了样',0,0);
/*!40000 ALTER TABLE `cr_msgs` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `cr_users`
--

DROP TABLE IF EXISTS `cr_users`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `cr_users` (
  `uid` char(36) NOT NULL,
  `uname` varchar(20) DEFAULT NULL,
  `upswd` varchar(20) DEFAULT NULL,
  `upriv` int(11) NOT NULL DEFAULT '0',
  PRIMARY KEY (`uid`),
  UNIQUE KEY `uname` (`uname`,`upswd`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `cr_users`
--

LOCK TABLES `cr_users` WRITE;
/*!40000 ALTER TABLE `cr_users` DISABLE KEYS */;
INSERT INTO `cr_users` VALUES ('00000000-0000-0000-0000-000000000000','test','test',-1),('0a28fe8d-b365-4897-b818-fe38baf20191','test_user','123456',0),('43eb65dc-7d12-4e46-9e3e-650d2d727283','admin','admin',-1),('6937f16e-ef7f-42b4-a23f-b7e45966cb00','test_user','test',-1),('7a6418a6-24c5-4457-a1a0-e62d84e4fc26','一位名字很长的长者','zhangzhe666',0),('7cde4eb2-0219-4d74-b6b8-be55c17a3fd6','zhaoyonghe','aaaaaa',0),('7fbe559d-a3a8-47e5-a4c9-13fe31f67acd','vip_test','admin',1),('9053d4a3-fc4e-4d6f-9669-066bcb03ef9c','Raineast','178178',0),('b38d4ba1-2680-4fc3-b474-8ba0208cdee9','垃圾辣鸡拉基','123456',0),('c0de1862-255e-4bf7-b7f8-db77dcdf3cad','guoyangcong','123',0),('c1baaf63-4ce6-4adc-bf43-a6b2405ef8b0','第二个中文用户名','zhongwenyonghuming',0),('cbf49751-d5e4-4c45-91fb-809fc4f4d297','normal_test','admin',0),('ee3fba46-ac20-46b2-bcbe-4632f48def6e','黑暗中的一只白喵','12345678',0),('ef6725f2-e5ae-4b86-abf3-dcd128258d9d','gsxab','1511420gsb',0),('f4618c5c-2519-4824-9efe-e38b9bd5215e','蒋艺璇我名字就这么长','123456',0);
/*!40000 ALTER TABLE `cr_users` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2017-08-15 10:23:23
